Revit 2024 API
RebarContainerParameterManager.SetOverriddenParameterModifiable Method
 Sets this overridden parameter to be modifiable.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void SetOverriddenParameterModifiable(
	ElementId paramId
)
Visual Basic
Public Sub SetOverriddenParameterModifiable ( _
	paramId As ElementId _
)
Visual C++
public:
void SetOverriddenParameterModifiable(
	ElementId^ paramId
)
Parameters
paramId
Type: Autodesk.Revit.DB.ElementId
 Overridden parameter id
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  paramId has no override
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace